app/views/likes/_like.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", "iyPYzhQJ9hF9fbuq"], ["post_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", "iyPYzhQJ9hF9fbuq"], ["post_id", 1], ["LIMIT", 1]]
---
<% if logged_in? %>
  <% if current_user.likes.exists?(post: post) %>