app/views/users/show.html.erb

  <p>本日の日付: <%= Date.current.strftime('%Y/%-m/%-d') %></p>
  <p class="count">あなたの投稿件数: <%= current_user.posts.count %></p>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", "iyPYzhQJ9hF9fbuq"]]

          <th class="last">不利(disadvantageous)</th>
          <th><p><%= pluralize(post.likes.count, 'Like') %></p></th>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]