app/views/posts/index.html.erb

SELECT COUNT(*) FROM "posts"
---
    <p>本日の日付: <%= Date.current.strftime('%Y/%-m/%-d') %></p>
    <p class="count">件数: <%= Post.count %></p>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 6]]
---
            <th class="last">不利(disadvantageous)</th>
            <th><p><%= pluralize(post.likes.count, 'Like') %></p></th>