app/controllers/application_controller.rb

    def current_user
      @current_user ||= User.find(session[:user_id]) if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["id", "iyPYzhQJ9hF9fbuq"], ["LIMIT", 1]]