app/controllers/comments_controller.rb

   def create
     @post = Post.find(params[:post_id])
     @comment = @post.comments.new(comment_params)
     @comment.user = current_user
     if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "kkkk"], ["user_id", "iyPYzhQJ9hF9fbuq"], ["post_id", 1], ["created_at", "2023-04-21 19:07:17.476320"], ["updated_at", "2023-04-21 19:07:17.476320"]]

    def destroy
      @comment = @post.comments.find(params[:id])
      @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]

      def set_post
        @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]