app/controllers/guest_sessions_controller.rb

INSERT INTO "users" ("id", "name", "email", "password_digest", "created_at", "updated_at", "remember_digest", "activation_digest", "activated", "activated_at", "activation_sent_at", "reset_digest", "reset_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["email", "guest@example.com"], ["LIMIT", 1]]
---
    def create
      user = User.find_or_create_by(email: "guest@example.com") do |user|