app/controllers/likes_controller.rb

   def create
     @like = current_user.likes.find_or_initialize_by(post: @post) # ユーザーがすでに投稿を「いいね」していれば@likeにそのレコードを代入し、していなければ新規作成する

     if @like.persisted? # すでに存在している場合は削除し、メッセージを表示する
       @like.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", "iyPYzhQJ9hF9fbuq"], ["post_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]

    def set_post
      @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]