app/controllers/posts_controller.rb

 def paginate_posts(posts_to_paginate = nil)
   @pagy, @posts = pagy(posts_to_paginate.presence || Post.all, items: 10)
---
SELECT COUNT(*) FROM "posts"

  def index
    order_by = params[:order_by] || ''
    @posts = case order_by
             when 'created_at_desc'
               Post.order(created_at: :desc)
             when 'created_at_asc'
               Post.order(created_at: :asc)
             when 'likes_desc'
               Post.joins(:likes).group(:id).order('COUNT(likes.id) DESC')
---
SELECT COUNT(*) AS "count_all", "posts"."id" AS "posts_id" FROM "posts" INNER JOIN "likes" ON "likes"."post_id" = "posts"."id" GROUP BY "posts"."id" ORDER BY "posts"."created_at" DESC, COUNT(likes.id) DESC

def create
  @post = current_user.posts.build(post_params)
  if @post.save
---
INSERT INTO "posts" ("user_id", "select_1", "maker1", "image_url1", "image_url2", "image_url22", "image_url23", "image_url3", "image_url33", "image_url34", "content", "likes_count", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

def show
  @post = Post.find_by(id: params[:id])
  if !@post || !current_user
    flash[:error] = "投稿が見つかりませんでした。" if !@post
    flash[:alert] = "ログインしてください。" if !current_user
    redirect_to posts_path and return
  end

  @like = Like.find_by(user_id: current_user.id, post_id: @post.id) if current_user
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", "iyPYzhQJ9hF9fbuq"], ["post_id", 12], ["LIMIT", 1]]

def destroy
  @post = Post.find_by(id: params[:id])
  if @post.nil?
    flash[:alert] = "投稿が見つかりませんでした。"
    redirect_to root_path and return
  end

  if current_user.id != @post.user_id
    flash[:alert] = "投稿の所有者ではありません。"
    redirect_to root_path and return
  end

  if @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 13]]

 def set_user
  if params[:user_id].present?
    @user = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["id", "iyPYzhQJ9hF9fbuq"], ["LIMIT", 1]]

def check_user_and_post
  @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]