app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["email", "mihasiakihiro0818@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:session][:email].downcase)