app/controllers/users_controller.rb

    def paginate_posts(posts_to_paginate = nil)
      @pagy, @posts = pagy(posts_to_paginate.presence || Post.all, items: 10)
---
SELECT COUNT(*) FROM "posts"

    def paginate_users(users_to_paginate = nil)
      @pagy, @users = pagy(users_to_paginate.presence || User.all, items: 10)
---
SELECT COUNT(*) FROM "users"

    def follow
      @users = User.includes(:followers)
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["id", "xNbAJJGS3xBJFWEW"], ["LIMIT", 1]]

    def show
      @user = User.find(params[:id])
      order_by = params[:order_by] || ''
      @posts = case order_by
               when 'created_at_desc'
                 @user.posts.order(created_at: :desc)
               when 'created_at_asc'
                 @user.posts.order(created_at: :asc)
               when 'likes_desc'
                 Post.joins(:likes).where(user_id: @user.id).group(:id).order('COUNT(likes.id) DESC')
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["id", "c4Bjkcgf5zCzN9Qn"], ["LIMIT", 1]]
SELECT COUNT(*) AS "count_all", "posts"."id" AS "posts_id" FROM "posts" INNER JOIN "likes" ON "likes"."post_id" = "posts"."id" WHERE "posts"."user_id" = $1 GROUP BY "posts"."id" ORDER BY "posts"."created_at" DESC, COUNT(likes.id) DESC  [["user_id", "iyPYzhQJ9hF9fbuq"]]

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("id", "name", "email", "password_digest", "created_at", "updated_at", "remember_digest", "activation_digest", "activated", "activated_at", "activation_sent_at", "reset_digest", "reset_sent_at", "status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["id", "c4Bjkcgf5zCzN9Qn"], ["LIMIT", 1]]