app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["id", "iyPYzhQJ9hF9fbuq"], ["LIMIT", 1]]
---
    def liked_by?(post_id)
      likes.where(post_id: post_id).exists?